Tekla.Structures.Analysis.AnalysisRestraintData.RestraintTypeEnum
Defines all the restraint types.

Tekla.Structures.Analysis.AnalysisRestraintData.RestraintTypeEnum.NOT_DEFINED
The restraint type is not defined.

Tekla.Structures.Analysis.AnalysisRestraintData.RestraintTypeEnum.PARTIAL_RELEASE
The partial release type.

Tekla.Structures.Analysis.AnalysisRestraintData.RestraintTypeEnum.FIXED
The fixed release type.

Tekla.Structures.Analysis.AnalysisRestraintData.RestraintTypeEnum.FREE
The free release type.

Tekla.Structures.Analysis.AnalysisRestraintData.RestraintTypeEnum.SPRING
The spring release type.